DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыКПоступлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПоступлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОформлениюНакладныхПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоНакладным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоОрдерам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюОрдеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принимается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходныйОрдерНаТовары</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ЗаявкаНаВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ЗаказНаСборку</xr:Item>
				<xr:Item>Document.ЗаказНаПеремещение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспоряжениеНаНесколькоСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаполненияМногооборотнойТары</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаполненияМногооборотнойТары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеРанееПоступившейПартии</Name>
					<Comment>Служебный. Для ранее сформированных партий решение постановке на контроль принимается в распоряжении на приемку. Ордер его исполняет.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодлежитРазблокировке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроконтролироватьКачество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодтвержденияКачества</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/ПриходныйОрдер/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураЗаполнения") Тогда
		
		СтруктураЗаполнения = Параметры.СтруктураЗаполнения;
		
		РаспоряжениеНаПоступление = СтруктураЗаполнения.Распоряжение;
		КонтролируемаяПартия = СтруктураЗаполнения.КонтролируемаяПартия;
		Если Не СоздатьПриходныйОрдер(СтруктураЗаполнения) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	Иначе
		Ссылка = Параметры.Ссылка;
#Если Не МобильныйАвтономныйСервер Тогда
		ЗаполнямыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Распоряжение,КонтролируемаяПартия");
		РаспоряжениеНаПоступление = ЗаполнямыеРеквизиты.Распоряжение;
		КонтролируемаяПартия = ЗаполнямыеРеквизиты.КонтролируемаяПартия;
#Иначе
		РаспоряжениеНаПоступление = Параметры.Ссылка.Распоряжение;
#КонецЕсли

	КонецЕсли;
	
	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;
	Штрихкод = Параметры.Штрихкод;
	ПорядокСканирования = Параметры.ПорядокСканирования;

	ЗаполнитьФорму();
	
	//++ Локализация
	
	ИспользоватьУчетМаркируемойПродукции = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();

#Если Не МобильныйАвтономныйСервер Тогда
	ПроверкаИПодборПродукцииИСПереопределяемый.ПриОпределенииОрганизации(Ссылка, Организация);

	ЕстьМаркируемаяПродукция = Ложь;
	ВидыПродукцииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	ПроверкаИПодборПродукцииИСМПУТ.ЕстьМаркируемаяПродукцияВКоллекции(ТоварыКПоступлению, ВидыПродукцииИСМП, ЕстьМаркируемаяПродукция);
	Если НЕ ЕстьМаркируемаяПродукция Тогда
		ПроверкаИПодборПродукцииИСМПУТ.ЕстьМаркируемаяПродукцияВКоллекции(ТоварыПринято, ВидыПродукцииИСМП, ЕстьМаркируемаяПродукция);
	КонецЕсли;
#Иначе
	ЕстьМаркируемаяПродукция = Ложь;
#КонецЕсли

	//-- Локализация

	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОформитьМеню("КПоступлению");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда

			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();

			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда

				Данные = МобильноеРабочееМестоКладовщикаКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);

				ОбработатьШтрихкод(Данные);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиВРазделКПриемке(Команда)
	ОформитьМеню("КПоступлению");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделПринято(Команда)
	ОформитьМеню("Принято");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "Приемка");
	ПараметрыФормы.Вставить("НомерСтроки", Элемент.ТекущаяСтрока);
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("РаспоряжениеНаПоступление", РаспоряжениеНаПоступление);
	ПараметрыФормы.Вставить("СкладскаяОперация", СкладскаяОперация);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПринятоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "РедактированиеПриемка");
	ПараметрыФормы.Вставить("НомерСтроки", ТоварыПринято.Индекс(Элементы.ТоварыПринято.ТекущиеДанные));
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("РаспоряжениеНаПоступление", РаспоряжениеНаПоступление);
	ПараметрыФормы.Вставить("СкладскаяОперация", СкладскаяОперация);

	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьПриемку(Команда)
	
	Если Не ИспользоватьСтатусыПриходныхОрдеров И ТоварыПринято.Количество() = 0 Тогда   		
		Состояние(НСтр("ru = 'Не возможно закончить приемку, пока не принято ни одного товара.'"));	
		Возврат;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Завершить'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Завершить приемку?'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)

	ОбновитьЗонуПриемкиАдресноеХранение();

КонецПроцедуры

&НаКлиенте
Процедура СобратьВсе(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСобратьВсе", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вкладка Принято будет очищена, продолжить?'"),РежимДиалогаВопрос.ДаНет,0);
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)

	Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипПоиска", "ПоискНоменклатуры");
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ДокументСсылка", Ссылка);
	ПараметрыФормы.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	ПараметрыФормы.Вставить("Организация", Организация);
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкода", ПараметрыФормы,
			ЭтотОбъект,,,, Описание,
			РежимОткрытияОкнаФормы.Независимый);
		Иначе
			ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкодаАвтономныйРежим", ПараметрыФормы,
			ЭтотОбъект,,,, Описание,
			РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПриемку(Команда)
	
	ИндексСтроки = ТоварыПринято.Индекс(Элементы.ТоварыПринято.ТекущиеДанные);
	Если ИндексСтроки >= 0 Тогда
		ТоварыПринято.Удалить(ИндексСтроки);
	КонецЕсли;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки(Команда)
	Описание = Новый ОписаниеОповещения("ИзменитьШтрихкодыУпаковок", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.СписокКодовМаркировки",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элементы.Помещение.Видимость      = ИспользоватьСкладскиеПомещения;
	Элементы.ЗонаПриемки.Видимость    = ИспользоватьАдресноеХранение;
	Элементы.КодыМаркировки.Видимость = ИспользоватьУчетМаркируемойПродукции И ЕстьМаркируемаяПродукция;
	Элементы.ИнформацияОбОтправителе.Видимость   = (ТипЗнч(Отправитель) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Отправитель) = Тип("СправочникСсылка.ФизическиеЛица"));
	
#Если МобильныйАвтономныйСервер Тогда
	Элементы.СобратьВсе.Видимость = Ложь;
	Элементы.ФормаОтменитьПриемкуОрдера.Видимость = Ложь;
#Иначе
	Статус = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	Если Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению И ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ПриходныйОрдерНаТовары) Тогда
		Элементы.ФормаОтменитьПриемкуОрдера.Видимость = Истина;
	Иначе
		Элементы.ФормаОтменитьПриемкуОрдера.Видимость = Ложь;
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеШтрихкода)

	ШтрихкодыВалидны = МобильноеРабочееМестоКладовщикаКлиент.ШтрихкодыВалидны(ДанныеШтрихкода);

	Если Не ШтрихкодыВалидны Тогда
		Возврат;
	КонецЕсли;

	Если Штрихкод = ДанныеШтрихкода.Штрихкод Тогда
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят")
			И ИспользоватьАдресноеХранение Тогда

			ЗаданияНаРазмещение = ДанныеЗаданийПоОрдеру();
			РезультатСканированияДокумента(ЗаданияНаРазмещение);

		ИначеЕсли ИспользоватьАдресноеХранение Тогда
			ЗакончитьПриемкуНаКлиенте(Ложь);
		Иначе
			ЗакончитьПриемкуНаКлиенте(Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ДанныеТоваров = ДанныеТоваровПоШК(ДанныеШтрихкода.Штрихкод);

	Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
		РезультатСканированияТовара(ДанныеТоваров);
		Возврат;
	КонецЕсли;

	Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));

КонецПроцедуры

&НаСервере
Функция ДанныеЗаданийПоОрдеру()

	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Склад", Склад);
	СтруктураПоиска.Вставить("Помещение", Помещение);
	СтруктураПоиска.Вставить("ЗонаПриемки", ЗонаПриемки);
	СтруктураПоиска.Вставить("ДатаОрдера", Дата);
	СтруктураПоиска.Вставить("Направление", "Приемка");

	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеЗаданийПоОрдеру(СтруктураПоиска);

КонецФункции

&НаКлиенте
Процедура РезультатСканированияДокумента(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Описание = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтотОбъект);

	Если ЗначениеЗаполнено(Результат.Ссылки) И ЗначениеЗаполнено(Результат.Режим) Тогда

		Описание = Новый ОписаниеОповещения("РезультатСканированияДокумента", ЭтотОбъект);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатСканирования", Результат);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВыбораСканирование", ПараметрыФормы,
			ЭтотОбъект,,,, Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	ИначеЕсли ЗначениеЗаполнено(Результат.Ссылки) И Не ЗначениеЗаполнено(Результат.Режим) Тогда

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", Результат.Ссылки[0]);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.РазмещениеПоЯчейкам", ПараметрыФормы,
			ЭтотОбъект,,,, Описание, РежимОткрытияОкнаФормы.Независимый);

	Иначе

		СтруктураНовогоРазмещения = НовоеРазмещениеТоваров();

		Если ЗначениеЗаполнено(СтруктураНовогоРазмещения.ТекстОшибкиПроверки) Тогда
			Состояние(СтруктураНовогоРазмещения.ТекстОшибкиПроверки);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтруктураНовогоРазмещения.Ссылка) Тогда
			Возврат;
		КонецЕсли;

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", СтруктураНовогоРазмещения.Ссылка);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Штрикход", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.РазмещениеПоЯчейкам", ПараметрыФормы,
			ЭтотОбъект,,,, Описание, РежимОткрытияОкнаФормы.Независимый);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НовоеРазмещениеТоваров()

	ПараметрыРазмещения = Обработки.МобильноеРабочееМестоКладовщика.ПараметрыСозданияРазмещенияТоваров();
	ПараметрыРазмещения.Склад = Склад;
	ПараметрыРазмещения.Помещение = Помещение;
	ПараметрыРазмещения.Исполнитель = Исполнитель;
	ПараметрыРазмещения.ЗонаПриемки = ЗонаПриемки;
	ПараметрыРазмещения.ТаблицаНоменклатуры =  ТоварыПринято.Выгрузить();

	СтруктураНовогоРазмещения = Обработки.МобильноеРабочееМестоКладовщика.НовоеРазмещениеТоваров(ПараметрыРазмещения);

	Возврат СтруктураНовогоРазмещения;

КонецФункции

&НаКлиенте
Процедура РезультатСканированияТовара(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Количество() > 1 Тогда

		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);

		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Товары", Результат);
		ЗначенияЗаполнения.Вставить("Режим", "ВыборНоменклатуры");
		ЗначенияЗаполнения.Вставить("Штрихкод", "");

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатСканирования", ЗначенияЗаполнения);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВыбораСканирование", ПараметрыФормы,
			ЭтотОбъект,,,,Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	Иначе

		ДанныеТовара = Результат[0];

		Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", ДанныеТовара.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика", ДанныеТовара.Характеристика);
		ПараметрыФормы.Вставить("Серия", ДанныеТовара.Серия);
		ПараметрыФормы.Вставить("Упаковка", ДанныеТовара.Упаковка);
		ПараметрыФормы.Вставить("Количество", ДанныеТовара.Количество);
		ПараметрыФормы.Вставить("Режим", "Приемка");
		ПараметрыФормы.Вставить("НомерСтроки", 0);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение);
		ПараметрыФормы.Вставить("ШтрихкодУпаковки", ДанныеТовара.ШтрихкодУпаковки);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
		ПараметрыФормы.Вставить("Источник", Ссылка);
		ПараметрыФормы.Вставить("РаспоряжениеНаПоступление", РаспоряжениеНаПоступление);
		ПараметрыФормы.Вставить("СкладскаяОперация", СкладскаяОперация);

		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьПриходныйОрдер(СтруктураЗаполнения)
	
#Если Не МобильныйАвтономныйСервер Тогда

	НовыйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	НовыйОрдер.Заполнить(СтруктураЗаполнения);
	НовыйОрдер.Дата = ТекущаяДатаСеанса();
	НовыйОрдер.Исполнитель = МобильноеРабочееМестоКладовщика.ТекущийПользователь();
	
	ПараметрыУказанияСерий = Документы.ПриходныйОрдерНаТовары.ПараметрыУказанияСерий(НовыйОрдер);
	МобильноеРабочееМестоКладовщика.ЗаполнитьСтатусыУказанияСерий(НовыйОрдер, ПараметрыУказанияСерий);
	СтруктураДействий = Новый Структура();
	КонтрольКачестваКэш = КонтрольКачества.КэшДанныхМеханизма(НовыйОрдер);
	СтруктураДействий.Вставить("ЗаполнитьПроконтролироватьКачествоДатаПодтвержденияКачества", КонтрольКачестваКэш);
	СтруктураДействий.Вставить("ЗаполнитьПодлежитРазблокировкеДатаПодтвержденияКачества", КонтрольКачестваКэш);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйОрдер.Товары, СтруктураДействий);
	
	Если НовыйОрдер.Товары.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
		
	НовыйОрдер.Записать(РежимЗаписиДокумента.Запись);
	
	Склад       = НовыйОрдер.Склад;
	Помещение   = НовыйОрдер.Помещение;
	Исполнитель = НовыйОрдер.Исполнитель;
	
	Ссылка = НовыйОрдер.Ссылка;
	
	Возврат Истина;

#Иначе

	Возврат Ложь;

#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ОформитьМеню(ИмяВкладки)
	
	ПоказатьМеню();
	
	Элементы.РамкаКПоступлению.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаКПоступлению.ЦветТекста = WebЦвета.ТемноСерый;
	
	Элементы.РамкаПринято.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаПринято.ЦветТекста = WebЦвета.ТемноСерый;
	
	Если ИмяВкладки = "КПоступлению" Тогда
		Элементы.РамкаКПоступлению.Картинка = БиблиотекаКартинок.РамкаМенюЧерная;
		Элементы.КомандаКПоступлению.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКПоступлению;
	ИначеЕсли ИмяВкладки = "Принято" Тогда
		Элементы.РамкаПринято.Картинка = БиблиотекаКартинок.РамкаМенюЧерная;
		Элементы.КомандаПринято.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПринято;
	КонецЕсли;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиКомандМеню()
	Элементы.КомандаКПоступлению.Заголовок = СтрШаблон(НСтр("ru = 'К приемке (%1)'"), ТоварыКПоступлению.Количество());
	Элементы.КомандаПринято.Заголовок = СтрШаблон(НСтр("ru = 'Принято (%1)'"), ТоварыПринято.Количество());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
#Если Не МобильныйАвтономныйСервер Тогда

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Номер КАК Номер,
		|	ПриходныйОрдерНаТовары.Дата КАК Дата,
		|	ПриходныйОрдерНаТовары.Статус КАК Статус,
		|	ПриходныйОрдерНаТовары.Склад КАК Склад,
		|	ПриходныйОрдерНаТовары.Исполнитель КАК Исполнитель,
		|	ПриходныйОрдерНаТовары.Комментарий КАК Комментарий,
		|	ПриходныйОрдерНаТовары.Помещение КАК Помещение,
		|	ПриходныйОрдерНаТовары.ЗонаПриемки КАК ЗонаПриемки,
		|	ПриходныйОрдерНаТовары.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	ПриходныйОрдерНаТовары.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	ПриходныйОрдерНаТовары.Отправитель КАК Отправитель,
		|	ПриходныйОрдерНаТовары.СкладскаяОперация КАК СкладскаяОперация,
		|	ПриходныйОрдерНаТовары.Склад.ИспользоватьОрдернуюСхемуПриПоступлении КАК ИспользоватьОрдернуюСхемуПриПоступлении,
		|	ПриходныйОрдерНаТовары.Склад.ИспользоватьСтатусыПриходныхОрдеров КАК ИспользоватьСтатусыПриходныхОрдеров,
		|	ПриходныйОрдерНаТовары.Склад.ИспользоватьСкладскиеПомещения КАК ИспользоватьСкладскиеПомещения,
		|	ВЫБОР
		|		КОГДА ПриходныйОрдерНаТовары.Склад.ИспользоватьСкладскиеПомещения
		|			ТОГДА ПриходныйОрдерНаТовары.Помещение.ИспользоватьАдресноеХранение
		|		ИНАЧЕ ПриходныйОрдерНаТовары.Склад.ИспользоватьАдресноеХранение
		|	КОНЕЦ КАК ИспользоватьАдресноеХранение
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура.Артикул КАК Артикул,
		|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
		|	ПриходныйОрдерНаТоварыТовары.Назначение КАК Назначение,
		|	ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
		|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
		|	ПриходныйОрдерНаТоварыТовары.Серия КАК Серия
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|ГДЕ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Артикул КАК Артикул,
		|	ВТТовары.Характеристика КАК Характеристика,
		|	ВТТовары.Назначение КАК Назначение,
		|	ВТТовары.Упаковка КАК Упаковка,
		|	ВТТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТТовары.Количество КАК Количество,
		|	ВТТовары.Серия КАК Серия
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Артикул КАК Артикул,
		|	ВТТовары.Характеристика КАК Характеристика,
		|	ВТТовары.Назначение КАК Назначение,
		|	ВТТовары.Упаковка КАК Упаковка,
		|	ВТТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТТовары.Количество КАК Количество,
		|	ВТТовары.Серия КАК Серия
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0";
	
	Колонки = ШтрихкодыУпаковок.Выгрузить().Колонки;
	Если Колонки.ШтрихкодУпаковки.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.ШтрихкодыУпаковок КАК ПриходныйОрдерНаТоварыШтрихкодыУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка = &Ссылка";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.ШтрихкодыУпаковок КАК ПриходныйОрдерНаТоварыШтрихкодыУпаковок
		|ГДЕ
		|	ПриходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка = &Ссылка";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ТоварыКПоступлению.Загрузить(РезультатЗапроса[2].Выгрузить());
	ТоварыПринято.Загрузить(РезультатЗапроса[3].Выгрузить());
	ШтрихкодыУпаковок.Загрузить(РезультатЗапроса[4].Выгрузить());

#Иначе

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Номер КАК Номер,
		|	ПриходныйОрдерНаТовары.Дата КАК Дата,
		|	ПриходныйОрдерНаТовары.Склад КАК Склад,
		|	ПриходныйОрдерНаТовары.Исполнитель КАК Исполнитель,
		|	ПриходныйОрдерНаТовары.Комментарий КАК Комментарий,
		|	ПриходныйОрдерНаТовары.Помещение КАК Помещение,
		|	ПриходныйОрдерНаТовары.ЗонаПриемки КАК ЗонаПриемки,
		|	ПриходныйОрдерНаТовары.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	ПриходныйОрдерНаТовары.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	ПриходныйОрдерНаТовары.Отправитель КАК Отправитель,
		|	ПриходныйОрдерНаТовары.СкладскаяОперация КАК СкладскаяОперация,
		|	ПриходныйОрдерНаТовары.Склад.ИспользоватьОрдернуюСхемуПриПоступлении КАК ИспользоватьОрдернуюСхемуПриПоступлении,
		|	ВЫБОР
		|		КОГДА ПриходныйОрдерНаТовары.Склад.ИспользоватьСкладскиеПомещения
		|			ТОГДА ПриходныйОрдерНаТовары.Помещение.ИспользоватьАдресноеХранение
		|		ИНАЧЕ ПриходныйОрдерНаТовары.Склад.ИспользоватьАдресноеХранение
		|	КОНЕЦ КАК ИспользоватьАдресноеХранение
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура.Артикул КАК Артикул,
		|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
		|	ПриходныйОрдерНаТоварыТовары.Назначение КАК Назначение,
		|	ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
		|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
		|	ПриходныйОрдерНаТоварыТовары.Серия КАК Серия
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|ГДЕ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Артикул КАК Артикул,
		|	ВТТовары.Характеристика КАК Характеристика,
		|	ВТТовары.Назначение КАК Назначение,
		|	ВТТовары.Упаковка КАК Упаковка,
		|	ВТТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТТовары.Количество КАК Количество,
		|	ВТТовары.Серия КАК Серия
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Артикул КАК Артикул,
		|	ВТТовары.Характеристика КАК Характеристика,
		|	ВТТовары.Назначение КАК Назначение,
		|	ВТТовары.Упаковка КАК Упаковка,
		|	ВТТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТТовары.Количество КАК Количество,
		|	ВТТовары.Серия КАК Серия
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ТоварыКПоступлению.Загрузить(РезультатЗапроса[2].Выгрузить());
	ТоварыПринято.Загрузить(РезультатЗапроса[3].Выгрузить());

#КонецЕсли

	Если ЗначениеЗаполнено(НомерВходящегоДокумента) И ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		ИнформацияОДокументе = СтрШаблон(НСтр("ru = '№ %1 от %2, %3'"),
			НомерВходящегоДокумента, Формат(ДатаВходящегоДокумента, НСтр("ru = 'ДФ=''дд.ММ.гг ЧЧ:мм'''")), Статус);
	Иначе
		ИнформацияОДокументе = СтрШаблон(НСтр("ru = '№ %1 от %2, %3'"),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер), Формат(Дата, НСтр("ru = 'ДФ=''дд.ММ.гг ЧЧ:мм'''")), Статус);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьФормуНаСервере(Результат);
	Если ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		РезультатСканированияТовара(Результат.ДанныеСледующегоТовара);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере(Результат)

	КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);
	
	Если Результат.Режим = "РедактированиеПриемка" Тогда
		
		Литерал = "НомерСтроки";
		НомерСтроки = Результат[Литерал];
		
		ТоварыПринято[НомерСтроки].Упаковка           = Результат.Упаковка;
		ТоварыПринято[НомерСтроки].КоличествоУпаковок = Результат.КоличествоУпаковок;
		ТоварыПринято[НомерСтроки].Количество         = ТоварыПринято[НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
		ТоварыПринято[НомерСтроки].Серия              = Результат.Серия;
		ТоварыПринято[НомерСтроки].Назначение         = Результат.Назначение;
		
	Иначе
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
		СтруктураПоиска.Вставить("Серия", Результат.Серия);
		СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
		СтруктураПоиска.Вставить("Назначение", Результат.Назначение);
		
		РезультатПоиска = ТоварыПринято.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		Иначе
			НоваяСтрока = ТоварыПринято.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаКодМаркировки Из Результат.ШтрихкодыУпаковок Цикл
		
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКодМаркировки);
		
	КонецЦикла;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьПриемкуНаКлиенте(Закрыть)

	ПриемкаЗавершена = ЗакончитьПриемкуНаСервере();

	Если ПриемкаЗавершена И Закрыть Тогда
		Закрыть();
	ИначеЕсли Не ПриемкаЗавершена Тогда
		Состояние(ТекстОшибки);
	Иначе
		ЗаполнитьФорму();
		СформироватьЗаголовкиКомандМеню();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗакончитьПриемкуНаСервере()
	
	ОрдерОбъект = Ссылка.ПолучитьОбъект();
	
	ОрдерОбъект.Помещение               = Помещение;
	ОрдерОбъект.Комментарий             = Комментарий;
	ОрдерОбъект.ЗонаПриемки             = ЗонаПриемки;
	ОрдерОбъект.Исполнитель             = Исполнитель;
	ОрдерОбъект.НомерВходящегоДокумента = НомерВходящегоДокумента;
	ОрдерОбъект.ДатаВходящегоДокумента  = ДатаВходящегоДокумента;
	
	Если ИспользоватьСкладскиеПомещения И Не ЗначениеЗаполнено(Помещение) Тогда

		ТекстОшибки = НСтр("ru = 'Не выбрано помещение'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ИспользоватьАдресноеХранение И Не ЗначениеЗаполнено(ЗонаПриемки) Тогда

		ТекстОшибки = НСтр("ru = 'Не выбрана зона приемки'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		Возврат Ложь;
		
	КонецЕсли;
	
	// Не проводим документ если не указаны упаковки
	МассивСообщений = Новый Массив;
	Если ИспользоватьАдресноеХранение Тогда
		Для Каждого Строка Из ТоварыПринято Цикл
			
			Если Не ЗначениеЗаполнено(Строка.Упаковка)
				Или (МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Строка.Упаковка, "Владелец") = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения
				И МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Строка.Упаковка, "ТипИзмеряемойВеличины") = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук) Тогда
				
				ТекстСообщения = Строка(Строка.Номенклатура);
				
				Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Строка.Характеристика);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.Серия) Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Строка.Серия);
				КонецЕсли;
				
				МассивСообщений.Добавить(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстСообщения = НСтр("ru = 'Укажите упаковки для позиций:'");
		Для Каждого ЭлСообщения Из МассивСообщений Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + ЭлСообщения;
		КонецЦикла;
		ТекстОшибки = ТекстСообщения;
		Возврат Ложь;

	КонецЕсли;
	
	Для Каждого Строка Из ТоварыПринято Цикл
		
		ВидНоменклатуры    = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "ВидНоменклатуры");
		ПолитикаУчетаСерий = Обработки.МобильноеРабочееМестоКладовщика.ПолитикаУчетаСерий(ВидНоменклатуры, Склад);
		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			ИспользоватьСерии = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий, "УказыватьПриПриемке");
		Иначе
			ИспользоватьСерии = Ложь;
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Строка.Серия) И (ЗначениеЗаполнено(ИспользоватьСерии) И ИспользоватьСерии) Тогда
			
			ТекстСообщения = Строка(Строка.Номенклатура);
			
			Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Строка.Характеристика);
			КонецЕсли;
			
			МассивСообщений.Добавить(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстСообщения = НСтр("ru = 'Укажите серии для позиций:'");
		Для Каждого ЭлСообщения Из МассивСообщений Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + ЭлСообщения;
		КонецЦикла;
		ТекстОшибки = ТекстСообщения;
		Возврат Ложь;

	КонецЕсли;
	
	Если ТоварыПринято.Количество() <> 0 Тогда
		ОрдерОбъект.Товары.Очистить();
		ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	Иначе
		ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
	КонецЕсли;
	
	Для Каждого Строка Из ТоварыПринято Цикл
		
		НоваяСтрока = ОрдерОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
#Если Не МобильныйАвтономныйСервер Тогда
	ОрдерОбъект.ШтрихкодыУпаковок.Очистить();
	Для Каждого СтрокаШК Из ШтрихкодыУпаковок Цикл
		
		НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = СтрокаШК.ШтрихкодУпаковки;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий = Документы.ПриходныйОрдерНаТовары.ПараметрыУказанияСерий(ОрдерОбъект);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОрдерОбъект, ПараметрыУказанияСерий);

	СтруктураДействий = Новый Структура();
	КонтрольКачестваКэш = КонтрольКачества.КэшДанныхМеханизма(ОрдерОбъект);
	СтруктураДействий.Вставить("ЗаполнитьПроконтролироватьКачествоДатаПодтвержденияКачества", КонтрольКачестваКэш);
	СтруктураДействий.Вставить("ЗаполнитьПодлежитРазблокировкеДатаПодтвержденияКачества", КонтрольКачестваКэш);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОрдерОбъект.Товары, СтруктураДействий);
#Иначе

	ПараметрыУказанияСерий = Документы.ПриходныйОрдерНаТовары.ПараметрыУказанияСерий(ОрдерОбъект);
	МобильноеРабочееМестоКладовщика.ЗаполнитьСтатусыУказанияСерий(ОрдерОбъект, ПараметрыУказанияСерий);
#КонецЕсли

	Попытка
		ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Информация(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
	СкрытьМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОформитьМеню("Принято");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЗонуПриемки()
	
	ЗонаПриемки = МобильноеРабочееМестоКладовщика.ЗонаПриемкиПоУмолчанию(Склад, Помещение);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗонуПриемкиАдресноеХранение()

	ЗаполнитьЗонуПриемки();

	ИспользоватьАдресноеХранение = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Помещение,
		"ИспользоватьАдресноеХранение");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМеню()

	Элементы.ГруппаМеню.Видимость = Истина;
	Элементы.ГруппаКоманды.Видимость = Истина;
	Элементы.ИнформацияОДокументе.Видимость = Истина;
	Элементы.ИнформацияОбОтправителе.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьМеню()

	Элементы.ГруппаМеню.Видимость = Ложь;
	Элементы.ГруппаКоманды.Видимость = Ложь;
	Элементы.ИнформацияОДокументе.Видимость = Ложь;
	Элементы.ИнформацияОбОтправителе.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СобратьВсеНаСервере()

#Если НЕ МобильныйАвтономныйСервер Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	МАКСИМУМ(ТоварыКПоступлениюОстатки.Серия) КАК Серия
		|ПОМЕСТИТЬ Серии
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(,
		|		ДокументПоступления = &ДокументПоступления
		// Если распоряжение на приемку выдавалось на конкретную партию (например перемещение заблокированных товаров,
		// то принимать нужно ее, если нет, то все товары распоряжения.
		|			И (КонтролируемаяПартия = &КонтролируемаяПартия
		|				ИЛИ КонтролируемаяПартия = ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка))) КАК ТоварыКПоступлениюОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКПоступлениюОстатки.ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Назначение,
		|	ТоварыКПоступлениюОстатки.Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КоличествоУпаковок,
		|	ТоварыКПоступлениюОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	Серии.Серия КАК Серия
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(
		|			,
		|			ДокументПоступления = &ДокументПоступления
		// Если распоряжение на приемку выдавалось на конкретную партию (например перемещение заблокированных товаров,
		// то принимать нужно ее, если нет, то все товары распоряжения.
		|				И (КонтролируемаяПартия = &КонтролируемаяПартия
		|					ИЛИ КонтролируемаяПартия = ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка))
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТТовары)) КАК ТоварыКПоступлениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Серии КАК Серии
		|		ПО ТоварыКПоступлениюОстатки.ДокументПоступления = Серии.ДокументПоступления
		|			И ТоварыКПоступлениюОстатки.Номенклатура = Серии.Номенклатура
		|			И ТоварыКПоступлениюОстатки.Характеристика = Серии.Характеристика
		|			И ТоварыКПоступлениюОстатки.Назначение = Серии.Назначение
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0";
	
	Запрос.УстановитьПараметр("ДокументПоступления", РаспоряжениеНаПоступление);
	Запрос.УстановитьПараметр("КонтролируемаяПартия", КонтролируемаяПартия);
	Запрос.УстановитьПараметр("Товары", ТоварыКПоступлению.Выгрузить());
	
	Остатки = Запрос.Выполнить().Выгрузить();
	
	Если ИспользоватьАдресноеХранение Тогда
		РазбитьПоУпаковкамСправочно(Остатки);
		ТоварыПринято.Загрузить(Остатки);
	Иначе
		ТоварыПринято.Загрузить(Остатки);
		МобильноеРабочееМестоКладовщика.РазбитьТоварыПоТоварнымМестам(ТоварыПринято);
	КонецЕсли;
#КонецЕсли

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТоваровПоШК(Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеТоваровПоШК(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		ПриемкаЗавершена = ЗакончитьПриемкуНаСервере();
		
		Если ПриемкаЗавершена Тогда
			Закрыть();
		Иначе
			Состояние(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСобратьВсе(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СобратьВсеНаСервере();
		ОформитьМеню("Принято");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШтрихкодыУпаковок(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьШтрихкодыУпаковокНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьШтрихкодыУпаковокНаСервере(Результат)
	
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыУпаковок.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура РазбитьПоУпаковкамСправочно(Товары)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Количество КАК Количество,
	|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫРАЗИТЬ(Таблица.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	|	Таблица.Назначение КАК Назначение,
	|	Таблица.Серия КАК Серия
	|ПОМЕСТИТЬ ТаблицаНоменклатурыДляЗапроса
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(Таблица.НомерСтроки) КАК НомерСтроки,
	|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура).НаборУпаковок КАК НаборУпаковок,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Назначение КАК Назначение,
	|	Таблица.Серия КАК Серия,
	|	СУММА(Таблица.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	ТаблицаНоменклатурыДляЗапроса КАК Таблица
	|ГДЕ
	|	ЕСТЬNULL(Таблица.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Номенклатура,
	|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура).НаборУпаковок,
	|	Таблица.Характеристика,
	|	Таблица.Серия,
	|	Таблица.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнутреннийЗапрос.Номенклатура,
	|	ВнутреннийЗапрос.Количество,
	|	ВнутреннийЗапрос.ЭтоТоварноеМесто,
	|	ВнутреннийЗапрос.НомерСтроки,
	|	ВнутреннийЗапрос.Характеристика,
	|	ВнутреннийЗапрос.Назначение,
	|	ВнутреннийЗапрос.КоличествоВУпаковке,
	|	ВнутреннийЗапрос.Упаковка,
	|	ВнутреннийЗапрос.Серия,
	|	ВнутреннийЗапрос.ЕдиницаИзмеренияУпаковкиПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ТаблицаНоменклатуры.Количество КАК Количество,
	|		ЛОЖЬ КАК ЭтоТоварноеМесто,
	|		ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
	|		ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|		ТаблицаНоменклатуры.Назначение КАК Назначение,
	|		ТаблицаНоменклатуры.Серия КАК Серия,
	|		ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоВУпаковке,
	|		ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,
	|		ЕСТЬNULL(УпаковкиНоменклатуры.ЕдиницаИзмерения.Представление, """") КАК ЕдиницаИзмеренияУпаковкиПредставление
	|	ИЗ
	|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|			ПО (ТаблицаНоменклатуры.Номенклатура = УпаковкиНоменклатуры.Владелец
	|					ИЛИ ТаблицаНоменклатуры.НаборУпаковок = УпаковкиНоменклатуры.Владелец)
	|				И (НЕ УпаковкиНоменклатуры.ПометкаУдаления)
	|				И (ТаблицаНоменклатуры.Количество >= &ТекстЗапросаКоэффициентУпаковки)
	|				И (&ТекстЗапросаКоэффициентУпаковки <> 0)
	|				И (ЕСТЬNULL(УпаковкиНоменклатуры.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаНоменклатуры.Номенклатура,
	|		ТаблицаНоменклатуры.Количество,
	|		ИСТИНА,
	|		ТаблицаНоменклатуры.НомерСтроки,
	|		ТаблицаНоменклатуры.Характеристика,
	|		ТаблицаНоменклатуры.Назначение,
	|		ТаблицаНоменклатуры.Упаковка.КоличествоУпаковок,
	|		ТаблицаНоменклатуры.Упаковка,
	|		ТаблицаНоменклатуры.Серия,
	|		""""
	|	ИЗ
	|		ТаблицаНоменклатурыДляЗапроса КАК ТаблицаНоменклатуры
	|	ГДЕ
	|		ЕСТЬNULL(ТаблицаНоменклатуры.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)) КАК ВнутреннийЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнутреннийЗапрос.НомерСтроки,
	|	ВнутреннийЗапрос.КоличествоВУпаковке,
	|	ВнутреннийЗапрос.ЕдиницаИзмеренияУпаковкиПредставление";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		МобильноеРабочееМестоКладовщика.ТекстЗапросаКоэффициентаУпаковки(
			"УпаковкиНоменклатуры",
			"ТаблицаНоменклатуры.Номенклатура"));
	
	ТаблицаНоменклатуры = Товары.Скопировать();
	ТаблицаНоменклатуры.Колонки.Добавить("НомерСтроки",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
	
	НомерСтроки = 1;
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Таблица",ТаблицаНоменклатуры);
	
	Товары.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекНомерСтроки = Неопределено;
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекНазначение = Неопределено;
	ТекСерия = Неопределено;
	Количество = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НомерСтроки <> ТекНомерСтроки Тогда
			
			Если Количество <> Неопределено Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество = Количество;
				НоваяСтрока.КоличествоУпаковок = Количество;
				
				НоваяСтрока.Номенклатура = ТекНоменклатура;
				НоваяСтрока.Характеристика = ТекХарактеристика;
				НоваяСтрока.Назначение = ТекНазначение;
				НоваяСтрока.Серия = ТекСерия;
			КонецЕсли;
			
			ТекНомерСтроки              = Выборка.НомерСтроки;
			ТекНоменклатура             = Выборка.Номенклатура; 
			ТекХарактеристика           = Выборка.Характеристика;
			ТекНазначение               = Выборка.Назначение;
			ТекСерия                    = Выборка.Серия;
			
			Если Выборка.ЭтоТоварноеМесто Тогда
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество = Выборка.Количество;
				НоваяСтрока.КоличествоУпаковок =  Выборка.Количество * Выборка.КоличествоВУпаковке;
				НоваяСтрока.Упаковка = Выборка.Упаковка;
				
				НоваяСтрока.Номенклатура = ТекНоменклатура;
				НоваяСтрока.Характеристика = ТекХарактеристика;
				НоваяСтрока.Назначение = ТекНазначение;
				НоваяСтрока.Серия = ТекСерия;
				
				Продолжить;
				
			КонецЕсли;
			
			Количество = Выборка.Количество;//(Не Выборка.ЭтоТоварноеМесто, Выборка.Количество, Выборка.КоличествоУпаковок);
			
		КонецЕсли;
		
		Если Количество <> Неопределено Тогда
			Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
				КоличествоВДокумент = Цел(Количество / Выборка.КоличествоВУпаковке);
			Иначе
				КоличествоВДокумент = Количество;
			КонецЕсли;
			
			Если КоличествоВДокумент > 0 Тогда
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество = КоличествоВДокумент * Выборка.КоличествоВУпаковке;
				НоваяСтрока.КоличествоУпаковок = КоличествоВДокумент;
				НоваяСтрока.Упаковка = Выборка.Упаковка;
				
				НоваяСтрока.Номенклатура = ТекНоменклатура;
				НоваяСтрока.Характеристика = ТекХарактеристика;
				НоваяСтрока.Назначение = ТекНазначение;
				НоваяСтрока.Серия = ТекСерия;
				
				Если Количество = КоличествоВДокумент * Выборка.КоличествоВУпаковке Тогда
					Количество = Неопределено;
				Иначе
					Количество = Количество - КоличествоВДокумент * Выборка.КоличествоВУпаковке;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Количество <> Неопределено Тогда
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.КоличествоУпаковок = Количество;
		НоваяСтрока.Номенклатура = ТекНоменклатура;
		НоваяСтрока.Характеристика = ТекХарактеристика;
		НоваяСтрока.Назначение = ТекНазначение;
		НоваяСтрока.Серия = ТекСерия;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПриемкуОрдера(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Пометить ордер на удаление'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить приемку'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОтменитьПриемку", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Для отмены приемки необходимо пометить на удаление приходный ордер. Вернуться к редактированию будет невозможно. Пометить на удаление?'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОтменитьПриемку(Результат, Параметры) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		ПриемкаОтменена = ОтменитьПриемкуОрдераНаСервере();
		
		Если ПриемкаОтменена Тогда
			Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
				Закрыть();
			КонецЕсли;
			Закрыть();
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьПриемкуОрдераНаСервере()
	
#Если МобильныйАвтономныйСервер Тогда
	Возврат Ложь;
#Иначе
	Попытка
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		
		ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось отменить приемку.'"));
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
#КонецЕсли

КонецФункции

#КонецОбласти
